use [客戶購買訂單]
go
CREATE TABLE 客戶表
(
	編號 char(5) NOT NULL,
	姓名 nvarchar(10) NOT NULL,
	電話 nvarchar(15) NULL,
	城市 nvarchar(10) NULL,
	區域 nvarchar(10) NULL,
PRIMARY  KEY(編號)
)

INSERT INTO 客戶表
VALUES ('A01','陳甲','02-15813604','新北市','板橋區'),
	   ('A02','陳乙','02-72704530','新北市','三重區'),
	   ('A03','陳丙','02-60474426','新北市','永和區'),
	   ('A04','陳丁','02-17610465','新北市','新店區'),
	   ('A05','陳戊','02-62201536','新北市','淡水區'),
	   ('A06','陳己','02-48026016','新北市','樹林區'),
	   ('A07','陳庚','02-50285385','新北市','三芝區'),
	   ('A08','陳辛','02-77510178','新北市','石門區'),
	   ('A09','陳壬','02-42368605','新北市','八里區'),
	   ('A10','陳癸','02-32748358','新北市','金山區'),
	   ('B01','王子','02-20884876','台北市','松山區'),
	   ('B02','王丑','02-37888272','台北市','大安區'),
	   ('B03','王寅','02-11231412','台北市','大同區'),
	   ('B04','王卯','02-18356618','台北市','中山區'),
	   ('B05','王辰','02-43773288','台北市','內湖區'),
	   ('B06','王巳','02-47174482','台北市','南港區'),
	   ('B07','王午','02-43083111','台北市','士林區'),
	   ('B08','王未','02-68882071','台北市','北投區'),
	   ('B09','王申','02-23261535','台北市','信義區'),
	   ('B10','王酋','02-15813604','台北市','中正區'),
	   ('C01','王戌','02-57270453','台北市','萬華區'),
	   ('C02','王亥','02-56047442','台北市','南竿鄉')