use [客戶購買訂單]
go
CREATE TABLE 購買表
(
編號  CHAR(5),
品號  CHAR(5),
數量  INT NOT NULL,
PRIMARY KEY(編號,品號),
FOREIGN KEY(編號) REFERENCES 客戶表(編號)
ON UPDATE CASCADE
ON DELETE CASCADE,
FOREIGN KEY(品號) REFERENCES 產品表(品號)
)
INSERT INTO 購買表(編號,品號, 數量)
VALUES ('A01','A0001','16'),
	   ('A02','A0002','13'),
       ('A03','A0003','12'),
       ('A04','A0004','13'),
	   ('A05','A0005','12'),
	   ('A06','A0006','17'),
	   ('A07','A0007','15'),
	   ('A08','A0008','18'),
	   ('A09','A0009','18'),
	   ('A10','A0010','15'),
	   ('B01','A0001','16'),
	   ('B02','A0002','13'),
       ('B03','A0003','12'),
       ('B04','A0004','13'),
	   ('B05','A0005','12'),
	   ('B06','A0006','17'),
	   ('B07','A0007','15'),
	   ('B08','A0008','18'),
	   ('B09','A0009','18'),
	   ('B10','A0010','15'),
	   ('C01','A0001','18'),
	   ('C02','A0002','15')

